OpenNuvoton/M55M1BSP/SampleCode/NuMaker-M55M1/NuvotonAudioGUI_Firmware/main.c
/******************************************************************************
 * @file     main.c
 * @version  V1.00
 * @brief    NAU88C22 configuration tool main program
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2025 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/
#include <stdio.h>
#include <string.h>
#include <stdint.h>

#include "NuMicro.h"
#include "usbd_audio.h"
#include "user_config.h"
#include "i2c_process.h"
#include "codec_config.h"
#include "sysClk_config.h"
#include "adc_converter.h"

// Extern USB Variable Declaration
extern volatile uint32_t g_au32USBPlayRingBuff[];
extern volatile uint32_t g_au32USBRecRingBuff[];
extern volatile uint32_t g_au32I2STxPingPongBuff[];
extern volatile uint32_t g_au32I2SRxPingPongBuff[];
extern volatile uint8_t g_u8I2STxBuffIndex;
extern volatile uint8_t g_u8I2SRxBuffIndex;
extern volatile uint16_t g_u16PlayBack_Read_Ptr;
extern volatile uint16_t g_u16PlayBack_Write_Ptr;
extern volatile uint16_t g_u16PlayBack_Ptrs_Distance;
extern volatile uint16_t g_u16PlayBack_USB_BUFF_UPPER_THRE;
extern volatile uint16_t g_u16PlayBack_USB_BUFF_LOWER_THRE;
extern volatile uint16_t g_u16Record_Read_Ptr;
extern volatile uint16_t g_u16Record_Write_Ptr;

extern volatile uint8_t g_u8AudioRecorderState;
extern volatile uint8_t g_usbd_PlayMute;
extern volatile uint8_t g_usbd_RecMute;
extern volatile uint8_t g_u8USBTxDataLen;

// Extern GUI Variable Declaration
extern volatile uint8_t g_u8HIDCommandProcessing;
extern HIDTRANS_CMD_T g_sHidCmdH2D;  // Host to device
extern HIDTRANS_CMD_T g_sHidCmdD2H;  // Device to host
extern uint8_t g_au8ToI2CDataBuf[];  // Data from PC
extern uint8_t g_au8ToHIDDataBuf[];  // Data to PC
extern uint8_t g_au8USBDmaDataBuf[]; // Data for USBD DMA transfer
extern volatile uint8_t g_u8HIDInDone;
extern volatile uint16_t g_u16I2CRxDataLen;
extern uint8_t g_u8SlaveAddr;
extern volatile uint32_t g_u32I2C_ClockRate;
extern volatile uint16_t g_u16PowerOnDelay;

// Codec Info
extern volatile uint8_t g_u8DeviceID;
extern volatile uint8_t g_u8RegisterAddrH;
extern volatile uint8_t g_u8RegisterAddrL;
extern volatile uint16_t g_u16Data_Len;
extern volatile uint8_t g_u8WriteFail;
extern volatile uint16_t g_u16I2CTxData_Fail_Cnt;

// 7802 Info
extern volatile uint8_t g_u8Qurey_mode;
extern volatile uint8_t g_u8Channel_mode;
extern volatile uint8_t g_u8Sample_Num_H;
extern volatile uint8_t g_u8Sample_Num_L;
extern volatile uint8_t g_u8T1_delay_H;
extern volatile uint8_t g_u8T1_delay_L;
extern volatile uint8_t g_u8T2_delay_H;
extern volatile uint8_t g_u8T2_delay_L;
extern uint8_t g_au8ADCDataBuff[6144]; // max 1024(sample) * 3(byte) * 2 (ch)
extern volatile uint16_t g_u16SampleNum;
extern volatile uint16_t g_u16SampleNum_cnt;
extern volatile uint8_t g_u8read_process;
extern volatile uint8_t g_u8Read_process_stop;
extern volatile uint8_t g_u8_7802TimeOut;
extern volatile uint8_t g_u8_7802Singal_last_ch;

extern volatile uint8_t g_u8USBPlayEn;
extern volatile uint8_t g_u8USBRecEn;
extern volatile uint16_t g_u16PlayBack_MAX_USB_BUFFER_LEN;
extern volatile uint16_t g_u16UAC_MAX_USB_BUFFER_LEN;
extern volatile uint16_t g_u16PlayBack_I2S_BUFF_LEN;
extern volatile uint16_t g_u16UAC_I2S_BUFF_LEN;
extern volatile uint16_t g_u16usbd_PlaySampleRate;
extern volatile uint16_t g_u16usbd_PlaySampleRate_old;
extern volatile uint8_t g_u8UAC_ADAPTIVE;
extern volatile uint32_t g_u32I2S0SampleRate_old;
extern uint32_t g_u32PllClock;

/*----------------------------------------------------------------------------*/
/* Global Variables                                                           */
/*----------------------------------------------------------------------------*/
// FirmWare Version
__attribute__((section(".ARM.__at_0x00108a00"))) const uint32_t g_u32PID = 0x08020100;
volatile int16_t g_i16HIDDataLen;

// I2S parameter
volatile uint32_t g_u32I2S0SampleRate;
volatile uint32_t g_u32I2S0Channel = I2S_TDMCHNUM_2CH;
volatile uint32_t g_u32I2S0Channel_old = I2S_TDMCHNUM_2CH;
volatile uint32_t g_u32I2S0SerialMode;
volatile uint32_t g_u32I2S0Format;
volatile uint32_t g_u32I2S0Mono;
volatile uint32_t g_u32I2S0WordSize;
volatile uint32_t g_u32I2S0FrameSize;
volatile uint8_t g_u8PlaybackDeviceEn = 0;
volatile uint8_t g_u8RecordDeviceEn = 0;
volatile uint8_t g_bUnderFlow = FALSE; // No RingBuffer for reading
volatile uint8_t g_bOverFlow = FALSE;  // No RingBuffer for Writting
uint8_t g_au8Monitor_DataBuff[256]; // max 1024(sample) * 3(byte) * 2 (ch)
volatile uint8_t g8_Board_mode = Board_Normal;

//------------------------------------------------------------------------------
typedef struct dma_desc_t
{
    uint32_t ctl;
    uint32_t endsrc;
    uint32_t enddest;
    uint32_t offset;
} DMA_DESC_T;

#ifdef __ICCARM__
    #pragma data_alignment=32
    DMA_DESC_T DMA_TXDESC[2];
    DMA_DESC_T DMA_RXDESC[2];
#else
    DMA_DESC_T DMA_TXDESC[2] __attribute__((aligned(32)));
    DMA_DESC_T DMA_RXDESC[2] __attribute__((aligned(32)));
#endif

volatile uint8_t u8DipSwitch;

/*----------------------------------------------------------------------------*/
/* Functions declaration                                                      */
/*----------------------------------------------------------------------------*/
void AudioDeviceCtrl(void);
void PC_ProcHIDCmd(void);
void Flash_Init(void);
void Flash_Memory(void);
void PDMA_Init(void);
void HSUSBD_Init(void);
void I2C_Init(void);
void I2S_Init(void);
void Systick_Init(void);
void I2S_TX_Start(void);
void I2S_TX_Stop(void);
void I2S_RX_Start(void);
void I2S_RX_Stop(void);
void HSUSBD_EnableEPTrans(uint32_t epnum, uint8_t *buf, uint32_t len);
static uint32_t I2S_open(I2S_T *i2s,
                         uint32_t u32MasterSlave,
                         uint32_t u32SampleRate,
                         uint32_t u32WordWidth,
                         uint32_t u32Channels,
                         uint32_t u32Mono,
                         uint32_t u32DataFormat,
                         uint32_t u32I2S0FrameSize);

//------------------------------------------------------------------------------
void AudioDeviceCtrl(void)
{
    if (g_u8USBPlayEn)
    {
        if (!g_u8PlaybackDeviceEn)
        {
            g_u8PlaybackDeviceEn = 1;
            PlaybackPingpongBuffClear();
            I2S_TX_Start();
        }
    }
    else
    {
        if (g_u8PlaybackDeviceEn)
        {
            g_u8PlaybackDeviceEn = 0;
            I2S_TX_Stop();
        }
    }

    if (g_u8USBRecEn)
    {
        if (!g_u8RecordDeviceEn)
        {
            g_u8RecordDeviceEn = 1;
            RecordPingpongBuffClear();
            I2S_RX_Start();
        }
    }
    else
    {
        if (g_u8RecordDeviceEn)
        {
            g_u8RecordDeviceEn = 0;
            I2S_RX_Stop();
        }
    }
}

/*---------------------------------------------------------------------------------------------------------*/
/* MAIN function                                                                                           */
/*---------------------------------------------------------------------------------------------------------*/
int main(void)
{
    /* Unlock protected registers */
    SYS_UnlockReg();

    SYS_INIT();

    /* Init UART to 115200-8n1 for print message */
    InitDebugUart();

    PDMA_Init(); // PDMA Initialization Controller

    Flash_Init(); // Flash Initialization Controller

    Systick_Init();

    while (g_u16PowerOnDelay < 2000) {} // Delay 2s then start to init codec

    NAU88C22_CodecMst_Init(48000);

    g8_Board_mode = Board_Normal;

    I2C_Init();

    I2S_Init();

    HSUSBD_Init();

