OpenNuvoton/M55M1BSP/SampleCode/NuMaker-M55M1/NuvotonAudioGUI_Firmware/main.c
    HSUSBD_CLR_SE0();

    Systick_Init();

    SYS_LockReg();

    /* Set the initial logic value of AUDIO_JKEN as Hi */
    SET_GPIO_PD1();
    GPIO_SetMode(PD, BIT1, GPIO_MODE_OUTPUT);
    PD1 = 1;

    printf("\n\nCPU @ %dHz(PLL@ %dHz)\n", SystemCoreClock, PllClock);
    printf("+------------------------------------------------------------------------+\n");
    printf("|              Codec Configuration Tool for NAU88C22               |\n");
    printf("+------------------------------------------------------------------------+\n");
    printf("  This sample code is used to configure NAU88C22 via NuVotonAudioGUI.\n");
    printf("  User needs to install NuVotonAudioGUI on PC.\n");

    while (1)
    {
        PC_ProcHIDCmd();
    }
}

/**
 * @brief       Process HID command between Codec and PC
 * @param       None
 * @return      None
 * @details     This function is used to process HID command between Codec and PC.
 *              1. If command is read, then get data from I2C buffer and send to PC.
 *              2. If command is write, then save data to data flash and send Ack to PC.
 */
void PC_ProcHIDCmd(void)
{
    uint32_t HIRCTrimsts;

    if ((g_u8HIDCommandProcessing == FINISHED) || (g_u8read_process == 1))
    {
        uint8_t *ptr;
        uint16_t i;

        // I2C protocol
        if (g_sHidCmdH2D.u8CommandType == HIDTRANS_CMD_BONGIOVI ||
                g_sHidCmdH2D.u8CommandType == HIDTRANS_CMD_NUVOTON ||
                g_sHidCmdH2D.u8CommandType == HIDTRANS_CMD_DPS_SETTING ||
                g_sHidCmdH2D.u8CommandType == HIDTRANS_CMD_DPS_STRING ||
                g_sHidCmdH2D.u8CommandType == HIDTRANS_CMD_DATA_CONFIG ||
                g_sHidCmdH2D.u8CommandType == HIDTRANS_CMD_DATA_PRESET)
        {
            // respond result to PC
            if (g_sHidCmdH2D.u8Header == HIDTRANS_READ)
            {
                uint8_t u8FrameCnt = 0;
                g_i16HIDDataLen = g_u16I2CRxDataLen - I2C_PREFIX_LEN; // The first 4 I2C data are length, command and respond, not real data for HID
                g_sHidCmdD2H.u8Header = HIDTRANS_RESPOND;
                g_sHidCmdD2H.u8CommandType = g_au8ToHIDDataBuf[2];

                do
                {
                    g_sHidCmdD2H.u8DataLen = (g_i16HIDDataLen >= 60) ? 60 : (g_i16HIDDataLen % 60);
                    g_sHidCmdD2H.u8FrameNum = u8FrameCnt;

                    if (g_i16HIDDataLen > 60)
                    {
                        g_sHidCmdD2H.u8FrameNum |= 0x80;
                    }

                    ptr = (uint8_t *)g_au8USBDmaDataBuf;
                    HSUSBD_MemCopy(ptr, (uint8_t *)&g_sHidCmdD2H, HID_PREFIX_LEN);
                    HSUSBD_MemCopy((ptr + HID_PREFIX_LEN), (g_au8ToHIDDataBuf + I2C_PREFIX_LEN + (u8FrameCnt * 60)), (EPG_MAX_PKT_SIZE - HID_PREFIX_LEN));
                    HSUSBD_EnableEPTrans(EPG, ptr, EPG_MAX_PKT_SIZE);

                    while (!g_u8HIDInDone) {} // Wait EPG data transfer to PC

                    g_u8HIDInDone = 0;
                    memset((void *)g_au8USBDmaDataBuf, 0, EPG_MAX_PKT_SIZE);

                    g_i16HIDDataLen -= 60;
                    u8FrameCnt++;

                } while (g_i16HIDDataLen > 0);
            }
            else // g_sHidCmdH2D.u8Header == HIDTRANS_WRITE
            {
                // Save data to data flash first and then send Ack to PC
                if (g_u8ApplyFlag)
                {
                    Flash_Memory();
                    g_u8ApplyFlag = 0;
                }

                g_sHidCmdD2H.u8Header = HIDTRANS_ACK;
                g_sHidCmdD2H.u8FrameNum = 0x00;

                if ((g_sHidCmdH2D.u8CommandType == HIDTRANS_CMD_NUVOTON) ||
                        g_sHidCmdH2D.u8CommandType == HIDTRANS_CMD_DATA_CONFIG ||
                        g_sHidCmdH2D.u8CommandType == HIDTRANS_CMD_DATA_PRESET)
                {
                    g_sHidCmdD2H.u8DataLen = 0x01;
                }
                else
                {
                    g_sHidCmdD2H.u8DataLen = 0x00;
                    g_sHidCmdD2H.u8CommandType = 0x00;
                }

                ptr = (uint8_t *)g_au8USBDmaDataBuf;
                HSUSBD_MemCopy(ptr, (uint8_t *)&g_sHidCmdD2H, HID_PREFIX_LEN);

                for (i = 0; i < (EPG_MAX_PKT_SIZE - HID_PREFIX_LEN); i++)
                {
                    ptr[HID_PREFIX_LEN + i] = 0;
                }

                HSUSBD_EnableEPTrans(EPG, ptr, EPG_MAX_PKT_SIZE);

                while (!g_u8HIDInDone) {} // Wait EPG data transfer to PC

                g_u8HIDInDone = 0;
                memset((void *)g_au8USBDmaDataBuf, 0, EPG_MAX_PKT_SIZE);

                // After sending Ack to PC, reset MCU
                if (g_u8ResetFlag)
                {
                    g_u8ResetFlag = 0;
                    SYS_UnlockReg();
                    SYS_ResetChip(); // Chip reset
                }
            }
        }
        else if (g_sHidCmdH2D.u8CommandType == HIDTRANS_CMD_I2C)
        {
            if (g_sHidCmdH2D.u8Header == HIDTRANS_READ)
            {
                uint8_t u8FrameCnt = 0;
                g_sHidCmdD2H.u8Header = HIDTRANS_RESPOND;
                g_sHidCmdD2H.u8CommandType = HIDTRANS_CMD_I2C;
                g_i16HIDDataLen = (g_au8ToHIDDataBuf[1] << 8 | g_au8ToHIDDataBuf[0]) + 1; // Add address

                do
                {
                    g_sHidCmdD2H.u8DataLen = (g_i16HIDDataLen >= 60) ? 60 : (g_i16HIDDataLen % 60);
                    g_sHidCmdD2H.u8FrameNum = u8FrameCnt;

                    if (g_i16HIDDataLen > 60)
                    {
                        g_sHidCmdD2H.u8FrameNum |= 0x80;
                    }

                    ptr = (uint8_t *)g_au8USBDmaDataBuf;
                    HSUSBD_MemCopy(ptr, (uint8_t *)&g_sHidCmdD2H, HID_PREFIX_LEN);

                    if (u8FrameCnt == 0)
                    {
                        ptr[HID_PREFIX_LEN] = g_u8SlaveAddr + 1;
                        HSUSBD_MemCopy((ptr + HID_PREFIX_LEN + 1), (g_au8ToHIDDataBuf), (EPG_MAX_PKT_SIZE - HID_PREFIX_LEN - 1));
                    }
                    else
                    {
                        HSUSBD_MemCopy((ptr + HID_PREFIX_LEN), (g_au8ToHIDDataBuf + I2C_PREFIX_LEN + (u8FrameCnt * 60) - 1), (EPG_MAX_PKT_SIZE - HID_PREFIX_LEN));
                    }

                    HSUSBD_EnableEPTrans(EPG, ptr, EPG_MAX_PKT_SIZE);

                    while (!g_u8HIDInDone) {} // Wait EPG data transfer to PC

