OpenNuvoton/M55M1BSP/SampleCode/NuMaker-M55M1/NuvotonAudioGUI_Firmware/main.c
                    g_u8HIDInDone = 0;
                    memset((void *)g_au8USBDmaDataBuf, 0, EPG_MAX_PKT_SIZE);

                    g_i16HIDDataLen -= 60;
                    u8FrameCnt++;

                } while (g_i16HIDDataLen > 0);
            }
            else // g_sHidCmdH2D.u8Header == HIDTRANS_WRITE
            {
                g_sHidCmdD2H.u8Header = HIDTRANS_ACK;
                g_sHidCmdD2H.u8FrameNum = 0x00;
                g_sHidCmdD2H.u8DataLen = 0x01;

                ptr = (uint8_t *)g_au8USBDmaDataBuf;
                HSUSBD_MemCopy(ptr, (uint8_t *)&g_sHidCmdD2H, HID_PREFIX_LEN);

                for (i = 0; i < (EPG_MAX_PKT_SIZE - HID_PREFIX_LEN); i++)
                {
                    ptr[HID_PREFIX_LEN + i] = 0;
                }

                HSUSBD_EnableEPTrans(EPG, ptr, EPG_MAX_PKT_SIZE);

                while (!g_u8HIDInDone) {} // Wait EPG data transfer to PC

                g_u8HIDInDone = 0;
                memset((void *)g_au8USBDmaDataBuf, 0, EPG_MAX_PKT_SIZE);
            }
        }
        else if (g_sHidCmdH2D.u8CommandType == HIDTRANS_CMD_CODEC_I2S_SETTING)
        {

            if (g_sHidCmdH2D.u8Header == HIDTRANS_READ)
            {
                g_sHidCmdD2H.u8Header = HIDTRANS_RESPOND;
                g_sHidCmdD2H.u8DataLen = 0x06;
                g_sHidCmdD2H.u8FrameNum = 0x00;
                g_sHidCmdD2H.u8CommandType = g_sHidCmdH2D.u8CommandType;

                ptr = (uint8_t *)g_au8USBDmaDataBuf;
                HSUSBD_MemCopy(ptr, (uint8_t *)&g_sHidCmdD2H, HID_PREFIX_LEN);

                switch (g_u32I2S0SampleRate)
                {
                    case 96000:
                        ptr[HID_PREFIX_LEN + 0] = 0;
                        break;

                    case 48000:
                        ptr[HID_PREFIX_LEN + 0] = 1;
                        break;

                    case 32000:
                        ptr[HID_PREFIX_LEN + 0] = 2;
                        break;

                    case 16000:
                        ptr[HID_PREFIX_LEN + 0] = 3;
                        break;

                    case 8000:
                        ptr[HID_PREFIX_LEN + 0] = 4;
                        break;
                }

                switch (g_u32I2S0Channel)
                {
                    case I2S_TDMCHNUM_2CH:
                        ptr[HID_PREFIX_LEN + 1] = 0;
                        break;

                    case I2S_TDMCHNUM_4CH:
                        ptr[HID_PREFIX_LEN + 1] = 1;
                        break;
                }

                switch (g_u32I2S0SerialMode)
                {
                    case I2S_MODE_SLAVE:
                        ptr[HID_PREFIX_LEN + 2] = 0;
                        break;

                    case I2S_MODE_MASTER:
                        ptr[HID_PREFIX_LEN + 2] = 1;
                        break;
                }

                switch (g_u32I2S0Format)
                {
                    case I2S_FORMAT_I2S:
                        ptr[HID_PREFIX_LEN + 3] = 0;
                        break;

                    case I2S_FORMAT_I2S_MSB:
                        ptr[HID_PREFIX_LEN + 3] = 1;
                        break;

                    case I2S_FORMAT_PCM:
                        ptr[HID_PREFIX_LEN + 3] = 2;
                        break;

                    case I2S_FORMAT_PCM_MSB:
                        ptr[HID_PREFIX_LEN + 3] = 3;
                        break;
                }

                switch (g_u32I2S0WordSize)
                {
                    case I2S_DATABIT_16:
                        ptr[HID_PREFIX_LEN + 4] = 0;
                        break;

                    case I2S_DATABIT_32:
                        ptr[HID_PREFIX_LEN + 4] = 1;
                        break;

                    case I2S_DATABIT_24:
                        ptr[HID_PREFIX_LEN + 4] = 2;
                        break;
                }

                switch (g_u32I2S0FrameSize)
                {
                    case I2S_CHWIDTH_16:
                        ptr[HID_PREFIX_LEN + 5] = 0;
                        break;

                    case I2S_CHWIDTH_32:
                        ptr[HID_PREFIX_LEN + 5] = 1;
                        break;
                }

                HSUSBD_EnableEPTrans(EPG, ptr, EPG_MAX_PKT_SIZE);

                while (!g_u8HIDInDone) {} // Wait EPG data transfer to PC

                g_u8HIDInDone = 0;
                memset((void *)g_au8USBDmaDataBuf, 0, EPG_MAX_PKT_SIZE);
            }
            else
            {
                // Save data to data flash first and then send Ack to PC
                if (g_u8ApplyFlag)
                {
                    Flash_Memory();
                    g_u8ApplyFlag = 0;
                }

                g_sHidCmdD2H.u8Header = HIDTRANS_ACK;
                g_sHidCmdD2H.u8DataLen = 0x01;
                g_sHidCmdD2H.u8FrameNum = 0x00;
                g_sHidCmdD2H.u8CommandType = 0x00;

                ptr = (uint8_t *)g_au8USBDmaDataBuf;
                HSUSBD_MemCopy(ptr, (uint8_t *)&g_sHidCmdD2H, HID_PREFIX_LEN);

                for (i = 0; i < (EPG_MAX_PKT_SIZE - HID_PREFIX_LEN); i++)
                {
                    ptr[HID_PREFIX_LEN + i] = 0;
                }

                HSUSBD_EnableEPTrans(EPG, ptr, EPG_MAX_PKT_SIZE);

                while (!g_u8HIDInDone) {} // Wait EPG data transfer to PC

                g_u8HIDInDone = 0;
                memset((void *)g_au8USBDmaDataBuf, 0, EPG_MAX_PKT_SIZE);

                DelayUs(500);

                if ((g_u32I2S0Channel == I2S_TDMCHNUM_4CH) || (g_u32I2S0Channel_old != g_u32I2S0Channel))
                {
                    SYS_UnlockReg();
                    SYS_ResetChip(); // Chip reset
                }
            }
        }
        else if ((g_sHidCmdH2D.u8CommandType == HIDTRANS_CMD_7802_CONVERTER) || (g_u8read_process == 1)) // for new version 7802
        {
            if ((g_sHidCmdH2D.u8Header == HIDTRANS_READ) && (g_u8Read_process_stop == 0))
            {
                uint8_t u8FrameCnt = 0;
                uint16_t i;
                // uint8_t ret;
                g_u16SampleNum = g_u8Sample_Num_H << 8 | g_u8Sample_Num_L;

