OpenNuvoton/M55M1BSP/SampleCode/NuMaker-M55M1/NuvotonAudioGUI_Firmware/main.c
                if (g_u8Channel_mode == ADC_Single)
                    g_i16HIDDataLen = (g_u8Sample_Num_H << 8 | g_u8Sample_Num_L) * 3; // one Sample number = register ->0x12 (low byte)|0x13(middle byte)|0x14(high byte)
                else if (g_u8Channel_mode == ADC_Dual)
                    g_i16HIDDataLen = (g_u8Sample_Num_H << 8 | g_u8Sample_Num_L) * 3 * 2; // one Sample number = register ->0x12 (low byte)|0x13(middle byte)|0x14(high byte) *2 (ch)

                for (i = 0; i < g_u16SampleNum; i++) // if(ret == 0)
                {
                    if (g_u8Qurey_mode == ADC_Time_Delay)
                    {
                        NAU7802_Time_Delay();
                    }
                    else if (g_u8Qurey_mode == ADC_Polling)
                    {
                        NAU7802_Polling();
                    }

                    if (g_u16SampleNum_cnt == (g_u16SampleNum - 1))
                    {
                        g_u8read_process = 0;
                        g_u16SampleNum_cnt = 0;
                    }
                    else
                    {
                        g_u16SampleNum_cnt++;
                        g_u8read_process = 1;
                    }

                    if ((g_u8read_process == 0) && (g_u8_7802TimeOut == 0))
                    {
                        g_sHidCmdD2H.u8Header = HIDTRANS_RESPOND;
                        g_sHidCmdD2H.u8CommandType = HIDTRANS_CMD_7802_CONVERTER;

                        do
                        {
                            g_sHidCmdD2H.u8DataLen = (g_i16HIDDataLen >= 60) ? 60 : (g_i16HIDDataLen % 60);
                            g_sHidCmdD2H.u8FrameNum = u8FrameCnt;

                            if (g_i16HIDDataLen > 60)
                            {
                                g_sHidCmdD2H.u8FrameNum |= 0x80;
                            }

                            ptr = (uint8_t *)g_au8USBDmaDataBuf;
                            HSUSBD_MemCopy(ptr, (uint8_t *)&g_sHidCmdD2H, HID_PREFIX_LEN);
                            HSUSBD_MemCopy((ptr + HID_PREFIX_LEN), (g_au8ADCDataBuff + (u8FrameCnt * 60)), (EPG_MAX_PKT_SIZE - HID_PREFIX_LEN));
                            HSUSBD_EnableEPTrans(EPG, ptr, EPG_MAX_PKT_SIZE);

                            while (!g_u8HIDInDone) {} // Wait EPG data transfer to PC

                            g_u8HIDInDone = 0;
                            memset((void *)g_au8USBDmaDataBuf, 0, EPG_MAX_PKT_SIZE);

                            g_i16HIDDataLen -= 60;
                            u8FrameCnt++;

                        } while (g_i16HIDDataLen > 0);
                    }
                }
            }
            else // g_sHidCmdH2D.u8Header == HIDTRANS_WRITE
            {
                g_i16HIDDataLen = 0;
                g_u8Read_process_stop = 0;
                g_u8read_process = 0;
                g_u8_7802TimeOut = 0;
                g_u16SampleNum_cnt = 0;

                g_sHidCmdD2H.u8Header = HIDTRANS_ACK;
                g_sHidCmdD2H.u8FrameNum = 0x00;
                g_sHidCmdD2H.u8DataLen = 0x01;
                g_sHidCmdD2H.u8CommandType = HIDTRANS_CMD_7802_CONVERTER;

                ptr = (uint8_t *)g_au8USBDmaDataBuf;
                HSUSBD_MemCopy(ptr, (uint8_t *)&g_sHidCmdD2H, HID_PREFIX_LEN);

                for (i = 0; i < (EPG_MAX_PKT_SIZE - HID_PREFIX_LEN); i++)
                {
                    ptr[HID_PREFIX_LEN + i] = 0;
                }

                HSUSBD_EnableEPTrans(EPG, ptr, EPG_MAX_PKT_SIZE);

                while (!g_u8HIDInDone) {} // Wait EPG data transfer to PC

                g_u8HIDInDone = 0;
                memset((void *)g_au8USBDmaDataBuf, 0, EPG_MAX_PKT_SIZE);
            }
        }
        else if (g_sHidCmdH2D.u8CommandType == HIDTRANS_CMD_Monitor_data) // for new version 7802
        {
            if (g_sHidCmdH2D.u8Header == HIDTRANS_READ)
            {
                uint8_t u8FrameCnt = 0;
                uint16_t i, j;
                // uint8_t ret;
                g_u16SampleNum = g_u8Sample_Num_L;

                for (i = 0; i < g_u16SampleNum; i++)
                {
                    switch (g_u8Channel_mode)
                    {
                        case HIDTRANS_CMD_CODEC_DATA_9BIT:
                            g_u16I2CTxDataLen = 1; // Write 1 byte register
                            g_u16I2CRxDataLen = 2; // Read data length is 2
                            g_au8ToI2CDataBuf[0] = g_u8RegisterAddrL << 1;
                            break;

                        case HIDTRANS_CMD_CODEC_DATA_8BIT:
                            g_u16I2CTxDataLen = 1; // Write 1 byte register
                            g_u16I2CRxDataLen = 1; // Read data length is 1
                            g_au8ToI2CDataBuf[0] = g_u8RegisterAddrL;
                            break;

                        case HIDTRANS_CMD_CODEC_DATA_16BIT:
                            g_u16I2CTxDataLen = 2; // Write 2 byte register
                            g_u16I2CRxDataLen = 2; // Read data length is 2
                            g_au8ToI2CDataBuf[0] = g_u8RegisterAddrH;
                            g_au8ToI2CDataBuf[1] = g_u8RegisterAddrL;
                            break;
                    }

                    pI2CProtocolCallback = Codec_I2CCallback;
                    I2C_SET_CONTROL_REG(I2C_PORT, I2C_CTL_STA); // Start I2C transmission

                    while ((g_u16I2CTxDataCnt != g_u16I2CTxDataLen)) {}

                    if (g_u8T1_delay_L > 0)
                    {
                        for (j = 0; j < 1000; j++) // us * 1000 =1 ms
                        {
                            DelayUs(g_u8T1_delay_L);
                        }
                    }
                    else
                    {
                        DelayUs(500);
                    }

                    if (g_sHidCmdH2D.u8CommandType == HIDTRANS_CMD_CODEC_DATA_8BIT)
                    {
                        g_au8Monitor_DataBuff[g_u16SampleNum_cnt * 2 + 0] = 0;
                        g_au8Monitor_DataBuff[g_u16SampleNum_cnt * 2 + 1] = g_au8ToHIDDataBuf[1];
                    }
                    else
                    {
                        g_au8Monitor_DataBuff[g_u16SampleNum_cnt * 2 + 0] = g_au8ToHIDDataBuf[0];
                        g_au8Monitor_DataBuff[g_u16SampleNum_cnt * 2 + 1] = g_au8ToHIDDataBuf[1];
                    }

                    if ((g_u16SampleNum_cnt == (g_u16SampleNum - 1)) || (g_u8WriteFail == 1))
                    {
                        g_u16SampleNum_cnt = 0;
                    }
                    else
                    {
                        g_u16SampleNum_cnt++;
                    }

                    if (g_u16SampleNum_cnt == 0)
                    {
                        g_sHidCmdD2H.u8Header = HIDTRANS_RESPOND;
                        g_sHidCmdD2H.u8CommandType = HIDTRANS_CMD_Monitor_data;
                        g_i16HIDDataLen = 4 + (g_u16SampleNum * 2);

                        do
                        {
                            if (g_u8WriteFail == 1)
                            {
                                g_sHidCmdD2H.u8DataLen = 3;
                                g_sHidCmdD2H.u8FrameNum = 0;
                            }
                            else
                            {
                                g_sHidCmdD2H.u8DataLen = (g_i16HIDDataLen >= 60) ? 60 : (g_i16HIDDataLen % 60);
                                g_sHidCmdD2H.u8FrameNum = u8FrameCnt;
                            }

                            if (g_i16HIDDataLen > 60)
                            {
                                g_sHidCmdD2H.u8FrameNum |= 0x80;
                            }

                            ptr = (uint8_t *)g_au8USBDmaDataBuf;
                            HSUSBD_MemCopy(ptr, (uint8_t *)&g_sHidCmdD2H, HID_PREFIX_LEN);

                            if (u8FrameCnt == 0)
                            {
                                if (g_u8WriteFail == 1)
                                {
                                    ptr[HID_PREFIX_LEN + 0] = !g_u8WriteFail; // 1:write success, 0: fail
                                    ptr[HID_PREFIX_LEN + 1] = g_u8RegisterAddrH;
                                    ptr[HID_PREFIX_LEN + 2] = g_u8RegisterAddrL;

                                    g_u8WriteFail = 0;
                                }
                                else
                                {
                                    ptr[HID_PREFIX_LEN + 0] = !g_u8WriteFail;
                                    ptr[HID_PREFIX_LEN + 1] = g_u8RegisterAddrH;
                                    ptr[HID_PREFIX_LEN + 2] = g_u8RegisterAddrL;
                                    ptr[HID_PREFIX_LEN + 3] = g_u16SampleNum & 0xff;
                                    HSUSBD_MemCopy((ptr + HID_PREFIX_LEN + 4), (g_au8Monitor_DataBuff), (EPG_MAX_PKT_SIZE - HID_PREFIX_LEN - 4));
                                }
                            }
                            else
                            {
                                HSUSBD_MemCopy((ptr + HID_PREFIX_LEN), (g_au8Monitor_DataBuff + (u8FrameCnt * 60) - 4), (EPG_MAX_PKT_SIZE - HID_PREFIX_LEN));
                            }

                            HSUSBD_EnableEPTrans(EPG, ptr, EPG_MAX_PKT_SIZE);

                            while (!g_u8HIDInDone) {} // Wait EPG data transfer to PC

