OpenNuvoton/M55M1BSP/SampleCode/NuMaker-M55M1/NuvotonAudioGUI_Firmware/main.c
                            g_u8HIDInDone = 0;
                            memset((void *)g_au8USBDmaDataBuf, 0, EPG_MAX_PKT_SIZE);

                            g_i16HIDDataLen -= 60;
                            u8FrameCnt++;

                        } while (g_i16HIDDataLen > 0);
                    }
                }
            }
        } // end if (g_sHidCmdH2D.u8CommandType == HIDTRANS_CMD_Monitor_data)
        else if (g_sHidCmdH2D.u8CommandType == HIDTRANS_CMD_I2C_CLK_SET)
        {
            if (g_sHidCmdH2D.u8Header == HIDTRANS_READ)
            {
                g_sHidCmdD2H.u8Header = HIDTRANS_RESPOND;
                g_sHidCmdD2H.u8DataLen = 0x01;
                g_sHidCmdD2H.u8FrameNum = 0x00;
                g_sHidCmdD2H.u8CommandType = g_sHidCmdH2D.u8CommandType;

                ptr = (uint8_t *)g_au8USBDmaDataBuf;
                HSUSBD_MemCopy(ptr, (uint8_t *)&g_sHidCmdD2H, HID_PREFIX_LEN);

                switch (g_u32I2C_ClockRate)
                {
                    case 100000:
                        ptr[HID_PREFIX_LEN + 0] = 0;
                        break;

                    case 400000:
                        ptr[HID_PREFIX_LEN + 0] = 1;
                        break;

                    case 1000000:
                        ptr[HID_PREFIX_LEN + 0] = 2;
                        break;
                }

                HSUSBD_EnableEPTrans(EPG, ptr, EPG_MAX_PKT_SIZE);

                while (!g_u8HIDInDone) {} // Wait EPG data transfer to PC

                g_u8HIDInDone = 0;
                memset((void *)g_au8USBDmaDataBuf, 0, EPG_MAX_PKT_SIZE);
            }
            else // HIDTRANS_WRITE
            {
                // Save data to data flash first and then send Ack to PC
                if (g_u8ApplyFlag)
                {
                    Flash_Memory();
                    g_u8ApplyFlag = 0;
                }

                I2C_Close(I2C_PORT); // If there is no codec and init timeout, some wrong operation might occur

                pI2CProtocolCallback = NULL;

                I2C_Init();

                g_sHidCmdD2H.u8Header = HIDTRANS_ACK;
                g_sHidCmdD2H.u8DataLen = !g_u8WriteFail;
                g_sHidCmdD2H.u8FrameNum = 0x00;
                g_sHidCmdD2H.u8CommandType = 0x00;

                ptr = (uint8_t *)g_au8USBDmaDataBuf;
                HSUSBD_MemCopy(ptr, (uint8_t *)&g_sHidCmdD2H, HID_PREFIX_LEN);

                for (i = 0; i < (EPG_MAX_PKT_SIZE - HID_PREFIX_LEN); i++)
                {
                    ptr[HID_PREFIX_LEN + i] = 0;
                }

                HSUSBD_EnableEPTrans(EPG, ptr, EPG_MAX_PKT_SIZE);

                while (!g_u8HIDInDone) {} // Wait EPG data transfer to PC

                g_u8HIDInDone = 0;
                memset((void *)g_au8USBDmaDataBuf, 0, EPG_MAX_PKT_SIZE);
            }
        } // end if (g_sHidCmdH2D.u8CommandType == HIDTRANS_CMD_I2C_CLK_SET)
        else if (g_sHidCmdH2D.u8CommandType == HIDTRANS_CMD_CODEC_BURST_DATA_9BIT ||
                 g_sHidCmdH2D.u8CommandType == HIDTRANS_CMD_CODEC_BURST_DATA_8BIT ||
                 g_sHidCmdH2D.u8CommandType == HIDTRANS_CMD_CODEC_BURST_DATA_16BIT) // Start Codec protocol Burst mode
        {
            uint8_t u8FrameCnt = 0;

            // respond result to PC
            if (g_sHidCmdH2D.u8Header == HIDTRANS_READ)
            {
                g_sHidCmdD2H.u8Header = HIDTRANS_RESPOND;
                g_i16HIDDataLen = 5 + g_u16Data_Len;

                g_sHidCmdD2H.u8FrameNum = 0;
                g_sHidCmdD2H.u8CommandType = g_sHidCmdH2D.u8CommandType;

                do
                {
                    g_sHidCmdD2H.u8DataLen = (g_i16HIDDataLen >= 60) ? 60 : (g_i16HIDDataLen % 60);
                    g_sHidCmdD2H.u8FrameNum = u8FrameCnt;

                    if (g_i16HIDDataLen > 60)
                    {
                        g_sHidCmdD2H.u8FrameNum |= 0x80;
                    }

                    ptr = (uint8_t *)g_au8USBDmaDataBuf;
                    HSUSBD_MemCopy(ptr, (uint8_t *)&g_sHidCmdD2H, HID_PREFIX_LEN);

                    if (u8FrameCnt == 0)
                    {
                        ptr[HID_PREFIX_LEN + 0] = g_u8DeviceID;
                        ptr[HID_PREFIX_LEN + 1] = g_u8RegisterAddrH;
                        ptr[HID_PREFIX_LEN + 2] = g_u8RegisterAddrL;
                        ptr[HID_PREFIX_LEN + 3] = (g_u16Data_Len >> 8) & 0xff;
                        ptr[HID_PREFIX_LEN + 4] = (g_u16Data_Len) & 0xff;
                        HSUSBD_MemCopy((ptr + HID_PREFIX_LEN + 5), (g_au8ToHIDDataBuf), (EPG_MAX_PKT_SIZE - HID_PREFIX_LEN - 5));
                    }
                    else
                    {
                        HSUSBD_MemCopy((ptr + HID_PREFIX_LEN), (g_au8ToHIDDataBuf + (u8FrameCnt * 60) - 5), (EPG_MAX_PKT_SIZE - HID_PREFIX_LEN));
                    }

                    HSUSBD_EnableEPTrans(EPG, ptr, EPG_MAX_PKT_SIZE);

                    while (!g_u8HIDInDone) {} // Wait EPG data transfer to PC

                    g_u8HIDInDone = 0;
                    memset((void *)g_au8USBDmaDataBuf, 0, EPG_MAX_PKT_SIZE);

                    g_i16HIDDataLen -= 60;
                    u8FrameCnt++;

                } while (g_i16HIDDataLen > 0);
            }
            else // g_sHidCmdH2D.u8Header == HIDTRANS_WRITE
            {
                g_sHidCmdD2H.u8Header = HIDTRANS_ACK;
                g_sHidCmdD2H.u8FrameNum = 0;
                g_sHidCmdD2H.u8CommandType = g_sHidCmdH2D.u8CommandType;

                if (g_u8WriteFail)
                {
                    g_sHidCmdD2H.u8DataLen = 6;

                    ptr = (uint8_t *)g_au8USBDmaDataBuf;
                    HSUSBD_MemCopy(ptr, (uint8_t *)&g_sHidCmdD2H, HID_PREFIX_LEN);
                    ptr[HID_PREFIX_LEN + 0] = g_u8DeviceID;
                    ptr[HID_PREFIX_LEN + 1] = g_u8RegisterAddrH;
                    ptr[HID_PREFIX_LEN + 2] = g_u8RegisterAddrL;
                    ptr[HID_PREFIX_LEN + 3] = 2; // 2:Burst Fail 1:write success, 0: fail
                    ptr[HID_PREFIX_LEN + 4] = (g_u16I2CTxData_Fail_Cnt >> 8) & 0XFF;
                    ptr[HID_PREFIX_LEN + 5] = g_u16I2CTxData_Fail_Cnt;
                }
                else
                {
                    g_sHidCmdD2H.u8DataLen = 4;

                    ptr = (uint8_t *)g_au8USBDmaDataBuf;
                    HSUSBD_MemCopy(ptr, (uint8_t *)&g_sHidCmdD2H, HID_PREFIX_LEN);
                    ptr[HID_PREFIX_LEN + 0] = g_u8DeviceID;
                    ptr[HID_PREFIX_LEN + 1] = g_u8RegisterAddrH;
                    ptr[HID_PREFIX_LEN + 2] = g_u8RegisterAddrL;
                    ptr[HID_PREFIX_LEN + 3] = !g_u8WriteFail; // 1:write success, 0: fail
                }

                g_u8WriteFail = 0;
                g_u16I2CTxData_Fail_Cnt = 0;
                HSUSBD_EnableEPTrans(EPG, ptr, EPG_MAX_PKT_SIZE);

                while (!g_u8HIDInDone) {} // Wait EPG data transfer to PC

