OpenNuvoton/M55M1BSP/SampleCode/NuMaker-M55M1/NuvotonAudioGUI_Firmware/main.c
                g_u8HIDInDone = 0;
                memset((void *)g_au8USBDmaDataBuf, 0, EPG_MAX_PKT_SIZE);
            }

            // Reset buffer
            for (i = 0; i < I2C_BUFF_SIZE; i++)
            {
                g_au8ToI2CDataBuf[i] = 0;
                g_au8ToHIDDataBuf[i] = 0;
            }

            g_u16I2CRxDataLen = 0;
            g_u8HIDCommandProcessing = NOT_PROCESSING;
        } // end Codec protocol  Burst mode
        else // Start Codec protocol  Normal mode
        {
            // respond result to PC
            if (g_sHidCmdH2D.u8Header == HIDTRANS_READ)
            {
                g_sHidCmdD2H.u8Header = HIDTRANS_RESPOND;

                if ((g_sHidCmdH2D.u8CommandType == HIDTRANS_CMD_BOARD_STATE) || (g_sHidCmdH2D.u8CommandType == HIDTRANS_CMD_BOARD_NUM))
                    g_sHidCmdD2H.u8DataLen = 1;
                else if (g_sHidCmdH2D.u8CommandType == HIDTRANS_CMD_FW_VERSION)
                    g_sHidCmdD2H.u8DataLen = 3;
                else
                    g_sHidCmdD2H.u8DataLen = 4 + g_u16Data_Len;

                g_sHidCmdD2H.u8FrameNum = 0;
                g_sHidCmdD2H.u8CommandType = g_sHidCmdH2D.u8CommandType;

                ptr = (uint8_t *)g_au8USBDmaDataBuf;
                HSUSBD_MemCopy(ptr, (uint8_t *)&g_sHidCmdD2H, HID_PREFIX_LEN);
                ptr[HID_PREFIX_LEN + 0] = g_u8DeviceID;
                ptr[HID_PREFIX_LEN + 1] = g_u8RegisterAddrH;
                ptr[HID_PREFIX_LEN + 2] = g_u8RegisterAddrL;
                ptr[HID_PREFIX_LEN + 3] = g_u16Data_Len; // 2;  // Data length is 2

                switch (g_sHidCmdD2H.u8CommandType)
                {
                    case HIDTRANS_CMD_CODEC_DATA_9BIT:
                        for (i = 0; i < g_u16Data_Len; i++)
                        {
                            ptr[HID_PREFIX_LEN + 4 + i] = g_au8ToHIDDataBuf[i];
                        }

                        break;

                    case HIDTRANS_CMD_CODEC_DATA_8BIT:
                        if (g_u16Data_Len > 1)
                        {
                            for (i = 0; i < g_u16Data_Len; i++)
                            {
                                ptr[HID_PREFIX_LEN + 4 + i] = g_au8ToHIDDataBuf[i];
                            }
                        }
                        else
                        {
                            ptr[HID_PREFIX_LEN + 4] = 0;
                            ptr[HID_PREFIX_LEN + 5] = g_au8ToHIDDataBuf[0];
                        }

                        break;

                    case HIDTRANS_CMD_CODEC_DATA_16BIT:
                        for (i = 0; i < g_u16Data_Len; i++)
                        {
                            ptr[HID_PREFIX_LEN + 4 + i] = g_au8ToHIDDataBuf[i];
                        }

                        break;

                    case HIDTRANS_CMD_FW_VERSION:
                        ptr[HID_PREFIX_LEN + 0] = (g_u32PID >> 8) & 0xff;
                        ptr[HID_PREFIX_LEN + 1] = (g_u32PID >> 16) & 0xff;
                        ptr[HID_PREFIX_LEN + 2] = (g_u32PID >> 24) & 0xff;
                        break;

                    case HIDTRANS_CMD_BOARD_STATE:
                        ptr[HID_PREFIX_LEN + 0] = g8_Board_mode;
                        break;

                    case HIDTRANS_CMD_BOARD_NUM:
                        ptr[HID_PREFIX_LEN + 0] = sUserConfig.u8Default_BoardNum;
                        break;
                }

                HSUSBD_EnableEPTrans(EPG, ptr, EPG_MAX_PKT_SIZE);

                while (!g_u8HIDInDone) {} // Wait EPG data transfer to PC

                g_u8HIDInDone = 0;
                memset((void *)g_au8USBDmaDataBuf, 0, EPG_MAX_PKT_SIZE);
            }
            else // g_sHidCmdH2D.u8Header == HIDTRANS_WRITE
            {
                g_sHidCmdD2H.u8Header = HIDTRANS_ACK;

                if (g_sHidCmdH2D.u8CommandType == HIDTRANS_CMD_BOARD_NUM)
                {
                    g_sHidCmdD2H.u8DataLen = 1;
                    g_sHidCmdD2H.u8FrameNum = 0;
                    g_sHidCmdD2H.u8CommandType = g_sHidCmdH2D.u8CommandType;

                    ptr = (uint8_t *)g_au8USBDmaDataBuf;
                    HSUSBD_MemCopy(ptr, (uint8_t *)&g_sHidCmdD2H, HID_PREFIX_LEN);
                    ptr[HID_PREFIX_LEN + 0] = !g_u8WriteFail; // 1:write success, 0: fail
                }
                else
                {
                    g_sHidCmdD2H.u8DataLen = 4;
                    g_sHidCmdD2H.u8FrameNum = 0;
                    g_sHidCmdD2H.u8CommandType = g_sHidCmdH2D.u8CommandType;

                    ptr = (uint8_t *)g_au8USBDmaDataBuf;
                    HSUSBD_MemCopy(ptr, (uint8_t *)&g_sHidCmdD2H, HID_PREFIX_LEN);
                    ptr[HID_PREFIX_LEN + 0] = g_u8DeviceID;
                    ptr[HID_PREFIX_LEN + 1] = g_u8RegisterAddrH;
                    ptr[HID_PREFIX_LEN + 2] = g_u8RegisterAddrL;
                    ptr[HID_PREFIX_LEN + 3] = !g_u8WriteFail; // 1:write success, 0: fail
                }

                g_u8WriteFail = 0;
                HSUSBD_EnableEPTrans(EPG, ptr, EPG_MAX_PKT_SIZE);

                while (!g_u8HIDInDone) {} // Wait EPG data transfer to PC

                g_u8HIDInDone = 0;
                memset((void *)g_au8USBDmaDataBuf, 0, EPG_MAX_PKT_SIZE);
            }
        }

        // Reset buffer
        for (i = 0; i < I2C_BUFF_SIZE; i++)
        {
            g_au8ToI2CDataBuf[i] = 0;
            g_au8ToHIDDataBuf[i] = 0;
        }

        g_u16I2CRxDataLen = 0;
        g_u8HIDCommandProcessing = NOT_PROCESSING;
    } // End Codec protocol  Normal mode
    else if (g_u8HIDCommandProcessing == NO_DATA)
    {
        uint16_t i;
        uint8_t *ptr = (uint8_t *)g_au8USBDmaDataBuf;

        g_sHidCmdD2H.u8Header = HIDTRANS_RESPOND;
        g_sHidCmdD2H.u8DataLen = 0x00;
        g_sHidCmdD2H.u8FrameNum = 0x00;
        g_sHidCmdD2H.u8CommandType = g_sHidCmdH2D.u8CommandType;

        HSUSBD_MemCopy(ptr, (uint8_t *)&g_sHidCmdD2H, HID_PREFIX_LEN);

        for (i = 0; i < (EPG_MAX_PKT_SIZE - HID_PREFIX_LEN); i++)
        {
            ptr[HID_PREFIX_LEN + i] = 0;
        }

        HSUSBD_EnableEPTrans(EPG, ptr, EPG_MAX_PKT_SIZE);

        while (!g_u8HIDInDone) {} // Wait EPG data transfer to PC

