OpenNuvoton/M55M1BSP/SampleCode/NuMaker-M55M1/NuvotonAudioGUI_Firmware/main.c
        g_u8HIDInDone = 0;
        memset((void *)g_au8USBDmaDataBuf, 0, EPG_MAX_PKT_SIZE);

        g_u8HIDCommandProcessing = NOT_PROCESSING;
    }

    if (g_u8CheckConnection == 2)
    {
        uint8_t i;
        uint8_t *ptr = (uint8_t *)g_au8USBDmaDataBuf;

        g_sHidCmdD2H.u8Header = HIDTRANS_STATUS;
        g_sHidCmdD2H.u8DataLen = g_u8I2CTimeOut;
        g_sHidCmdD2H.u8FrameNum = 0x00;
        g_sHidCmdD2H.u8CommandType = 0x00;

        HSUSBD_MemCopy(ptr, (uint8_t *)&g_sHidCmdD2H, HID_PREFIX_LEN);

        for (i = 0; i < (EPG_MAX_PKT_SIZE - HID_PREFIX_LEN); i++)
        {
            ptr[HID_PREFIX_LEN + i] = 0;
        }

        HSUSBD_EnableEPTrans(EPG, ptr, EPG_MAX_PKT_SIZE);

        while (!g_u8HIDInDone) {} // Wait EPG data transfer to PC

        g_u8HIDInDone = 0;
        memset((void *)g_au8USBDmaDataBuf, 0, EPG_MAX_PKT_SIZE);

        if (g_u8I2CTimeOut)
        {
            g_u8HIDCommandProcessing = NOT_PROCESSING;
        }

        g_u8I2CTimeOut = 0;
        g_u8CheckConnection = 0;
    }

    AudioDeviceCtrl();

    // Check if autotrim complete
    //HIRCTrimsts = SYS->HIRCTISTS;
    HIRCTrimsts = SYS->TISTS48M;

    //if (HIRCTrimsts & SYS_HIRCTISTS_FREQLOCK_Msk)
    if (HIRCTrimsts & SYS_TISTS48M_FREQLOCK_Msk)
    {
        // turn autotrim off
        SYS->TCTL48M &= ~0x03;

        // clear flag
        SYS->TISTS48M = HIRCTrimsts;
    }
}

/*---------------------------------------------------------------------------------------------------------*/
/* ISR to handle PDMA interrupt event                                                                     */
/*---------------------------------------------------------------------------------------------------------*/
void PDMA0_IRQHandler(void)
{
    int i;
    uint32_t u32Status          = PDMA_GET_INT_STATUS(PDMA_PORT);
    uint32_t u32Transferdone    = PDMA_GET_TD_STS(PDMA_PORT);
    uint32_t *puPingpongBuff    = (uint32_t *)&g_au32I2STxPingPongBuff[0];
    uint32_t *puRingBuff        = (uint32_t *)&g_au32USBPlayRingBuff[0];
    uint32_t *puUACPingpongBuff = (uint32_t *)&g_au32I2SRxPingPongBuff[0];
    uint32_t *puUACRingBuff     = (uint32_t *)&g_au32USBRecRingBuff[0];

    // write 1 to clear
    PDMA_CLR_TD_FLAG(PDMA_PORT, u32Transferdone);

    // PDMA Read/Write Target Abort Interrupt Flag
    if (u32Status & PDMA_INTSTS_ABTIF_Msk)
    {
        // PDMA Channel 2 Read/Write Target Abort Interrupt Status Flag
        if (PDMA_GET_ABORT_STS(PDMA_PORT) & BIT2)
        {
            PDMA_CLR_ABORT_FLAG(PDMA_PORT, PDMA_ABTSTS_ABTIF2_Msk);
        }
    }
    else if (u32Status & PDMA_INTSTS_TDIF_Msk) // Transfer Done Interrupt Flag
    {
        // I2S Rx done
        if (u32Transferdone & BIT2)
        {
            PDMA_CLR_TD_FLAG(PDMA_PORT, PDMA_TDSTS_TDIF2_Msk);

            if (g_u8USBRecEn)
            {
                if ((I2S_PORT->CTL0 & I2S_CTL0_TDMCHNUM_Msk) == I2S_TDMCHNUM_4CH)
                {
                    if (g_u8AudioRecorderState == UAC_START_AUDIO_RECORD)
                    {
                        for (i = 0; i < g_u16UAC_I2S_BUFF_LEN; i++)
                        {
                            puUACRingBuff[g_u16Record_Write_Ptr] = puUACPingpongBuff[g_u16UAC_I2S_BUFF_LEN * g_u8I2SRxBuffIndex + i];
                            g_u16Record_Write_Ptr++;

                            if (g_u16Record_Write_Ptr == g_u16UAC_MAX_USB_BUFFER_LEN)
                            {
                                g_u16Record_Write_Ptr = 0;
                            }
                        }

                        // switch to another buffer row.
                        g_u8I2SRxBuffIndex ^= 0x1;
                        g_u8AudioRecorderState = UAC_PROCESSING_AUDIO_RECORD;
                    }
                    else if (g_u8AudioRecorderState == UAC_PROCESSING_AUDIO_RECORD)
                    {
                        for (i = 0; i < g_u16UAC_I2S_BUFF_LEN; i++)
                        {
                            puUACRingBuff[g_u16Record_Write_Ptr] = puUACPingpongBuff[g_u16UAC_I2S_BUFF_LEN * g_u8I2SRxBuffIndex + i];
                            g_u16Record_Write_Ptr++;

                            if (g_u16Record_Write_Ptr == g_u16UAC_MAX_USB_BUFFER_LEN)
                            {
                                g_u16Record_Write_Ptr = 0;
                            }
                        }

                        // switch to another buffer row.
                        g_u8I2SRxBuffIndex ^= 0x1;
                        g_u8AudioRecorderState = UAC_READY_AUDIO_RECORD;
                    }
                    else if (g_u8AudioRecorderState == UAC_READY_AUDIO_RECORD)
                    {
                        for (i = 0; i < g_u16UAC_I2S_BUFF_LEN; i++)
                        {
                            puUACRingBuff[g_u16Record_Write_Ptr] = puUACPingpongBuff[g_u16UAC_I2S_BUFF_LEN * g_u8I2SRxBuffIndex + i];
                            g_u16Record_Write_Ptr++;

                            if (g_u16Record_Write_Ptr == g_u16UAC_MAX_USB_BUFFER_LEN)
                            {
                                g_u16Record_Write_Ptr = 0;
                            }
                        }

                        // switch to another buffer row.
                        g_u8I2SRxBuffIndex ^= 0x1;
                        g_u8AudioRecorderState = UAC_BUSY_AUDIO_RECORD;
                    }
                    else if (g_u8AudioRecorderState == UAC_BUSY_AUDIO_RECORD)
                    {
                        for (i = 0; i < g_u16UAC_I2S_BUFF_LEN; i++)
                        {
                            puUACRingBuff[g_u16Record_Write_Ptr] = puUACPingpongBuff[g_u16UAC_I2S_BUFF_LEN * g_u8I2SRxBuffIndex + i];
                            g_u16Record_Write_Ptr++;

                            if (g_u16Record_Write_Ptr == g_u16UAC_MAX_USB_BUFFER_LEN)
                            {
                                g_u16Record_Write_Ptr = 0;
                            }
                        }

