OpenNuvoton/M55M1BSP/SampleCode/NuMaker-M55M1/NuvotonAudioGUI_Firmware/main.c
                        // switch to another buffer row.
                        g_u8I2SRxBuffIndex ^= 0x1;
                    }
                }
                else // I2S only 2 channel
                {
                    if (g_u8AudioRecorderState == UAC_START_AUDIO_RECORD)
                    {
                        for (i = 0; i < g_u16UAC_I2S_BUFF_LEN; i++)
                        {
                            puUACRingBuff[g_u16Record_Write_Ptr] = puUACPingpongBuff[g_u16UAC_I2S_BUFF_LEN * g_u8I2SRxBuffIndex + i];
                            g_u16Record_Write_Ptr++;

                            if (g_u16Record_Write_Ptr == g_u16UAC_MAX_USB_BUFFER_LEN)
                            {
                                g_u16Record_Write_Ptr = 0;
                            }
                        }

                        // switch to another buffer row.
                        g_u8I2SRxBuffIndex ^= 0x1;
                        g_u8AudioRecorderState = UAC_PROCESSING_AUDIO_RECORD;
                    }
                    else if (g_u8AudioRecorderState == UAC_PROCESSING_AUDIO_RECORD)
                    {
                        for (i = 0; i < g_u16UAC_I2S_BUFF_LEN; i++)
                        {
                            puUACRingBuff[g_u16Record_Write_Ptr] = puUACPingpongBuff[g_u16UAC_I2S_BUFF_LEN * g_u8I2SRxBuffIndex + i];
                            g_u16Record_Write_Ptr++;

                            if (g_u16Record_Write_Ptr == g_u16UAC_MAX_USB_BUFFER_LEN)
                            {
                                g_u16Record_Write_Ptr = 0;
                            }
                        }

                        // switch to another buffer row.
                        g_u8I2SRxBuffIndex ^= 0x1;
                        g_u8AudioRecorderState = UAC_READY_AUDIO_RECORD;
                    }
                    else if (g_u8AudioRecorderState == UAC_READY_AUDIO_RECORD)
                    {
                        for (i = 0; i < g_u16UAC_I2S_BUFF_LEN; i++)
                        {
                            puUACRingBuff[g_u16Record_Write_Ptr] = puUACPingpongBuff[g_u16UAC_I2S_BUFF_LEN * g_u8I2SRxBuffIndex + i];
                            g_u16Record_Write_Ptr++;

                            if (g_u16Record_Write_Ptr == g_u16UAC_MAX_USB_BUFFER_LEN)
                            {
                                g_u16Record_Write_Ptr = 0;
                            }
                        }

                        // switch to another buffer row.
                        g_u8I2SRxBuffIndex ^= 0x1;
                        g_u8AudioRecorderState = UAC_BUSY_AUDIO_RECORD;
                    }
                    else if (g_u8AudioRecorderState == UAC_BUSY_AUDIO_RECORD)
                    {
                        for (i = 0; i < g_u16UAC_I2S_BUFF_LEN; i++)
                        {
                            puUACRingBuff[g_u16Record_Write_Ptr] = puUACPingpongBuff[g_u16UAC_I2S_BUFF_LEN * g_u8I2SRxBuffIndex + i];
                            g_u16Record_Write_Ptr++;

                            if (g_u16Record_Write_Ptr == g_u16UAC_MAX_USB_BUFFER_LEN)
                            {
                                g_u16Record_Write_Ptr = 0;
                            }
                        }

                        // switch to another buffer row.
                        g_u8I2SRxBuffIndex ^= 0x1;
                    }
                }
            }
        }

        // I2S Tx done
        if (u32Transferdone & BIT1)
        {
            PDMA_CLR_TD_FLAG(PDMA_PORT, PDMA_TDSTS_TDIF1_Msk);

            if (g_u8USBPlayEn)
            {
                // When song played to end or pause, there will be no EPD anymore so Ringbuffer underflow
                // If keep last data, there will be a fixed DC on speaker, long time DC possibly makes speaker hot
                if ((g_u16PlayBack_Read_Ptr == g_u16PlayBack_Write_Ptr) && (g_bOverFlow == FALSE))
                {
                    for (i = 0; i < g_u16PlayBack_I2S_BUFF_LEN; i++)
                    {
                        puPingpongBuff[g_u16PlayBack_I2S_BUFF_LEN * g_u8I2STxBuffIndex + i] = 0x0;
                    }
                }
                else
                {
                    g_bOverFlow = FALSE;

                    if (g_usbd_PlayMute)
                    {
                        for (i = 0; i < g_u16PlayBack_I2S_BUFF_LEN; i++)
                        {
                            puPingpongBuff[g_u16PlayBack_I2S_BUFF_LEN * g_u8I2STxBuffIndex + i] = 0x0;
                            g_u16PlayBack_Read_Ptr++;
                        }

                        if (g_u16PlayBack_Read_Ptr >= g_u16PlayBack_MAX_USB_BUFFER_LEN)
                        {
                            g_u16PlayBack_Read_Ptr = 0;
                        }
                    }
                    else
                    {
                        if ((I2S_PORT->CTL0 & I2S_CTL0_TDMCHNUM_Msk) == I2S_TDMCHNUM_4CH)
                        {
                            for (i = 0; i < g_u16PlayBack_I2S_BUFF_LEN; i++)
                            {
                                // I2S TDM 4 channel condition
                                if ((i % 4 == 0) || (i % 4 == 1)) // channel 1 and channel 2 has data
                                {
                                    if ((I2S_PORT->CTL0 & I2S_CTL0_DATWIDTH_Msk) == I2S_DATABIT_16)
                                    {
                                        if (g_u8USBTxDataLen == USB_16bit)
                                            puPingpongBuff[g_u16PlayBack_I2S_BUFF_LEN * g_u8I2STxBuffIndex + i] = puRingBuff[g_u16PlayBack_Read_Ptr];
                                        else if (g_u8USBTxDataLen == USB_24bit)
                                            puPingpongBuff[g_u16PlayBack_I2S_BUFF_LEN * g_u8I2STxBuffIndex + i] = puRingBuff[g_u16PlayBack_Read_Ptr] >> 8;

                                        g_u16PlayBack_Read_Ptr++;
                                    }
                                    else if ((I2S_PORT->CTL0 & I2S_CTL0_DATWIDTH_Msk) == I2S_DATABIT_24)
                                    {
                                        if (g_u8USBTxDataLen == USB_16bit)
                                            puPingpongBuff[g_u16PlayBack_I2S_BUFF_LEN * g_u8I2STxBuffIndex + i] = puRingBuff[g_u16PlayBack_Read_Ptr] << 8;
                                        else if (g_u8USBTxDataLen == USB_24bit)
                                            puPingpongBuff[g_u16PlayBack_I2S_BUFF_LEN * g_u8I2STxBuffIndex + i] = (puRingBuff[g_u16PlayBack_Read_Ptr]);

                                        g_u16PlayBack_Read_Ptr++;
                                    }
                                    else //((I2S_PORT->CTL0 & I2S_CTL0_DATWIDTH_Msk) == I2S_DATABIT_32)
                                    {
                                        if (g_u8USBTxDataLen == USB_16bit)
                                            puPingpongBuff[g_u16PlayBack_I2S_BUFF_LEN * g_u8I2STxBuffIndex + i] = puRingBuff[g_u16PlayBack_Read_Ptr] << 16;
                                        else if (g_u8USBTxDataLen == USB_24bit)
                                            puPingpongBuff[g_u16PlayBack_I2S_BUFF_LEN * g_u8I2STxBuffIndex + i] = puRingBuff[g_u16PlayBack_Read_Ptr] << 8;

                                        g_u16PlayBack_Read_Ptr++;
                                    }
                                }
                                else // channel 2 and channel 4 has no data
                                {
                                    puPingpongBuff[g_u16PlayBack_I2S_BUFF_LEN * g_u8I2STxBuffIndex + i] = 0;
                                }
                            }
                        }
                        else // I2S only 2 channel
                        {
                            for (i = 0; i < g_u16PlayBack_I2S_BUFF_LEN; i++) // 48 * 2ch
                            {
                                if ((I2S_PORT->CTL0 & I2S_CTL0_DATWIDTH_Msk) == I2S_DATABIT_16)
                                {
                                    if (g_u8USBTxDataLen == USB_16bit)
                                        puPingpongBuff[g_u16PlayBack_I2S_BUFF_LEN * g_u8I2STxBuffIndex + i] = puRingBuff[g_u16PlayBack_Read_Ptr];
                                    else if (g_u8USBTxDataLen == USB_24bit)
                                        puPingpongBuff[g_u16PlayBack_I2S_BUFF_LEN * g_u8I2STxBuffIndex + i] = puRingBuff[g_u16PlayBack_Read_Ptr] >> 8;

                                    g_u16PlayBack_Read_Ptr++;
                                }
                                else if ((I2S_PORT->CTL0 & I2S_CTL0_DATWIDTH_Msk) == I2S_DATABIT_24)
                                {
#if (I2S_FIFO_24BIT_LSB)

                                    if (g_u8USBTxDataLen == USB_16bit)
                                        puPingpongBuff[g_u16PlayBack_I2S_BUFF_LEN * g_u8I2STxBuffIndex + i] = (puRingBuff[g_u16PlayBack_Read_Ptr] << 8);
                                    else if (g_u8USBTxDataLen == USB_24bit)
                                        puPingpongBuff[g_u16PlayBack_I2S_BUFF_LEN * g_u8I2STxBuffIndex + i] = (puRingBuff[g_u16PlayBack_Read_Ptr]);

