OpenNuvoton/M55M1BSP/SampleCode/NuMaker-M55M1/NuvotonAudioGUI_Firmware/main.c
#elif (I2S_FIFO_24BIT_MSB)
                                    puPingpongBuff[g_u16PlayBack_I2S_BUFF_LEN * g_u8I2STxBuffIndex + i] = puRingBuff[g_u16PlayBack_Read_Ptr] << 16;
#endif
                                    g_u16PlayBack_Read_Ptr++;
                                }
                                else //((I2S_PORT->CTL0 & I2S_CTL0_DATWIDTH_Msk) == I2S_DATABIT_32)
                                {
                                    if (g_u8USBTxDataLen == USB_16bit)
                                        puPingpongBuff[g_u16PlayBack_I2S_BUFF_LEN * g_u8I2STxBuffIndex + i] = puRingBuff[g_u16PlayBack_Read_Ptr] << 16;
                                    else if (g_u8USBTxDataLen == USB_24bit)
                                        puPingpongBuff[g_u16PlayBack_I2S_BUFF_LEN * g_u8I2STxBuffIndex + i] = puRingBuff[g_u16PlayBack_Read_Ptr] << 8;

                                    g_u16PlayBack_Read_Ptr++;
                                }
                            }
                        }

                        if (g_u16PlayBack_Read_Ptr >= g_u16PlayBack_MAX_USB_BUFFER_LEN)
                        {
                            g_u16PlayBack_Read_Ptr = 0;
                        }
                    }
                }

                if (g_u16PlayBack_Read_Ptr == g_u16PlayBack_Write_Ptr)
                    g_bUnderFlow = TRUE;

                // switch to another buffer row.
                g_u8I2STxBuffIndex ^= 0x1;
            }
        }
    }
}

/**
 * @brief       Flash Initial
 * @param[in]   None
 * @return      None
 * @details     Initialize the data flash and read user configuration from flash.
 */
void Flash_Init(void)
{
    uint16_t i, u16UserConfigSize;
    uint32_t *u32ptr = (uint32_t *)&sUserConfig;
    uint32_t u32RegLockLevel = SYS_IsRegLocked();

    if (u32RegLockLevel) SYS_UnlockReg();

    FMC_Open();

    u16UserConfigSize = sizeof(sUserConfig);

    for (i = 0; i < (u16UserConfigSize >> 2); i++)
    {
        *u32ptr = FMC_Read(DATA_FLASH_USERCONFIG_BASE + (i * 4)); /* Read a flash word from address DATA_FLASH_USERCONFIG_BASE+(i*4). */
        u32ptr++;
    }

    if (sUserConfig.u8Flag & 0x01) // flag == 1 means not write in yet
    {
        SetConfigToDefault();
    }

    FMC_Close();

    if (u32RegLockLevel) SYS_LockReg();
}

/**
 * @brief       Flash_Memory
 * @param[in]   None
 * @return      None
 * @details     Write user configuration to data flash.
 */
void Flash_Memory(void)
{
    uint16_t i, u16UserConfigSize;
    uint32_t *u32ptr = (uint32_t *)&sUserConfig;
    uint32_t u32RegLockLevel = SYS_IsRegLocked();

    if (u32RegLockLevel)
        SYS_UnlockReg();

    u16UserConfigSize = sizeof(sUserConfig);

    sUserConfig.u8Flag &= (~USER_CONFIG_MASK);

    FMC_Open();
    FMC_ENABLE_AP_UPDATE();
    FMC_Erase(DATA_FLASH_USERCONFIG_BASE); // Erase 1k data flash

    for (i = 0; i < (u16UserConfigSize >> 2); i += 2, u32ptr += 2)
    {
        FMC_Write8Bytes(DATA_FLASH_USERCONFIG_BASE + (i * 4), *(u32ptr), *(u32ptr + 1));
    }

    FMC_DISABLE_AP_UPDATE();
    FMC_Close();

    if (u32RegLockLevel)
        SYS_LockReg();
}

/**
 * @brief       PDMA Initial
 * @param[in]   None
 * @return      None
 * @details     Reset PDMA module and enable PDMA IRQ.
 */
void PDMA_Init()
{
    /* Reset PDMA module */
    SYS_ResetModule(PDMA_RST);

    /* Enable PDMA irq */
    NVIC_EnableIRQ(PDMA_IRQn);
}

/**
 * @brief       HSUSBD Initial
 * @param[in]   None
 * @return      None
 * @details     Initialize the USB device, set USB descriptors and UAC interface, configure endpoints.
 */
void HSUSBD_Init(void)
{
    // USB descriptor
    extern uint8_t gu8DeviceDescriptor[];
    extern uint8_t *gpu8UsbString[];
    extern uint8_t gu8ConfigDescriptor[];
    extern uint8_t gu8ConfigDescriptor_Normal_mode_Rec_4ch[];
    extern uint32_t gu32ConfigHidDescIdx[];
    extern uint8_t gu8VendorStringDesc[];
    extern uint8_t gu8ProductStringDesc[];
    extern uint8_t gu8StringSerial[];
    uint16_t u16i;

    // Fill in Manufacture
    for (u16i = 0; u16i < 16; u16i++)
    {
        gpu8UsbString[1][u16i] = gu8VendorStringDesc[u16i];
    }

    // Fill in Product
    for (u16i = 0; u16i < 46; u16i++)
    {
        gpu8UsbString[2][u16i] = gu8ProductStringDesc[u16i];
    }

    // Fill in SerialNumber
    for (u16i = 0; u16i < 26; u16i++)
    {
        gpu8UsbString[3][u16i] = gu8StringSerial[u16i];
    }

    if (g8_Board_mode == Board_Normal)
    {
        if (g_u32I2S0Channel == I2S_TDMCHNUM_2CH)
        {
            gsHSInfo.gu8ConfigDesc = gu8ConfigDescriptor;
        }
        else
        {
            gsHSInfo.gu8ConfigDesc = gu8ConfigDescriptor_Normal_mode_Rec_4ch;
            gu8DeviceDescriptor[8] = USBD_VID & 0xFF;
            gu8DeviceDescriptor[9] = (USBD_VID >> 8) & 0xFF;
            gu8DeviceDescriptor[10] = (USBD_PID + 2) & 0xFF; // USBD_PID =0x120D
            gu8DeviceDescriptor[11] = (USBD_PID >> 8) & 0xFF;
        }
    }

    // HSUSBD initial
    HSUSBD_Open(&gsHSInfo, UAC_ClassRequest, (HSUSBD_SET_INTERFACE_REQ)UAC_SetInterface);

    // Endpoint configuration
    UAC_Init();

    NVIC_EnableIRQ(HSUSBD_IRQn);
}

/**
 * @brief       I2C Initial
 * @param[in]   None
 * @return      None
 * @details     Reset I2C module, set I2C bus clock and enable I2C interrupt.
 */
void I2C_Init(void)
{
    if (g8_Board_mode == Board_Normal)
    {
        g_u32I2C_ClockRate = 400000;
    }

    switch (sUserConfig.u8I2C_Address)
    {
        case I2C_Addr_0x40:
            g_u8SlaveAddr = 0x40;
            break;

        case I2C_addr_0x42:
            g_u8SlaveAddr = 0x42;
            break;

        case I2C_Addr_0x44:
            g_u8SlaveAddr = 0x44;
            break;

        case I2C_Addr_0x46:
            g_u8SlaveAddr = 0x46;
            break;
    }

    /* Reset module */
    SYS_ResetModule(SYS_I2C3RST);

    /* Open I2C module and set bus clock */
    I2C_Open(I2C_PORT, g_u32I2C_ClockRate);

    /* Enable I2C interrupt */
    I2C_EnableInt(I2C_PORT);

