OpenNuvoton/M55M1BSP/SampleCode/NuMaker-M55M1/NuvotonAudioGUI_Firmware/main.c
    NVIC_ClearPendingIRQ(I2C3_IRQn);

    NVIC_EnableIRQ(I2C3_IRQn);
}

/**
 * @brief       I2S Initial
 * @param[in]   None
 * @return      None
 * @details     Initialize the I2S interface and set the I2S related parameters.
 */
//#define I2S_MASTER_SAMPLE_RATE  (USB_RATE)
//#define I2S_CLOCK_SOURCE_HIRC_48M
void I2S_Init(void)
{
    // flag == 1 means not write in yet
    if ((sUserConfig.u8Flag & 0x01) || (g8_Board_mode == Board_Normal))
    {
        /* Default setting */
        g_u32I2S0SampleRate = 48000;
        g_u32I2S0SampleRate_old = g_u32I2S0SampleRate;
        g_u32I2S0Channel = I2S_TDMCHNUM_2CH;
        g_u32I2S0Mono = I2S_STEREO;
        g_u32I2S0SerialMode = I2S_MODE_SLAVE;
        g_u32I2S0Format = I2S_FORMAT_I2S;
        g_u32I2S0WordSize = I2S_DATABIT_24;
        g_u32I2S0FrameSize = I2S_CHWIDTH_32;
    }

    PlaybackBuffInit();

    RecordBuffInit();

    if ((g_u32I2S0Channel == I2S_TDMCHNUM_4CH) && (g_u32I2S0SampleRate == 32000))
        g_u8UAC_ADAPTIVE = 1;

    CLK_EnableModuleClock(I2S_MODULE);

    // Select I2S clock.
    CLK_SetModuleClock(I2S_MODULE, I2S_CLKSRC, 0);

    // I2S IPReset.
    SYS_ResetModule(I2S_RST);

    // Open I2S hardware IP
    I2S_open(I2S_PORT, g_u32I2S0SerialMode, g_u32I2S0SampleRate, g_u32I2S0WordSize, g_u32I2S0Channel, g_u32I2S0Mono, g_u32I2S0Format, g_u32I2S0FrameSize);


    if (g_u32I2S0WordSize == I2S_DATABIT_16)
    {
        I2S_SET_PBWIDTH(I2S_PORT, I2S_PBWIDTH_16);
        I2S_SET_PB16ORD(I2S_PORT, I2S_PB16ORD_LOW);
    }
    else
    {
        I2S_SET_PBWIDTH(I2S_PORT, I2S_PBWIDTH_32);
    }

    // I2S Configuration
    I2S_SET_MONO_RX_CHANNEL(I2S_PORT, I2S_MONO_RIGHT);

    if (g_u32I2S0WordSize == I2S_DATABIT_16)
    {
        // Right channel at RXFIFO[31:24], Left channel at RXFIFO[15:0]
        I2S_SET_STEREOORDER(I2S_PORT, I2S_ORDER_EVENLOW);
    }
    else
    {
#if (I2S_FIFO_24BIT_LSB)
        // LSB of 24-bit audio data in each channel is aligned to right side in 32-bit FIFO entries.
        I2S_SET_STEREOORDER(I2S_PORT, I2S_ORDER_EVENHIGH);
#elif (I2S_FIFO_24BIT_MSB)
        // MSB of 24-bit audio data in each channel is aligned to left side in 32-bit FIFO entries.
        I2S_SET_STEREOORDER(I2S_PORT, I2S_ORDER_EVENLOW);
#endif
    }

    // Set channel width.
    I2S_SET_CHWIDTH(I2S_PORT, g_u32I2S0FrameSize);

    if (g_u32I2S0SerialMode == I2S_MODE_MASTER)
    {
        I2S_EnableMCLK(I2S_PORT, g_u32I2S0SampleRate * 500); //MCLK = 24M, with CLK_CLKSEL3_I2S0SEL_HIRC
    }
    else
    {
        I2S_EnableMCLK(I2S_PORT, 12000000); // MCLK = 12M, slave mode
    }
}

/**
 * @brief       Systick Initial
 *
 * @param[in]   None
 *
 * @return      None
 *
 * @details     Initialize the system tick and enable SysTick interrupt.
 */
void Systick_Init(void)
{
    SystemCoreClockUpdate();

    if (SysTick_Config(SystemCoreClock / 1000)) // 1ms
    {
        /* Setup SysTick Timer for 1 second interrupts  */
        printf("Set system tick error!!\n");

        while (1) {}
    }

    NVIC_SetPriority(SysTick_IRQn, 1);
}

/**
 * @brief       PDMA_I2S_RX_Init
 *
 * @param[in]   None
 *
 * @return      None
 *
 * @details     Initialize the PDMA channel for I2S0 RX request.
 */
void PDMA_I2S_RX_Init(void)
{
    DMA_RXDESC[0].ctl = (((g_u16UAC_I2S_BUFF_LEN) - 1) << PDMA_DSCT_CTL_TXCNT_Pos) | // transfer byte count
                        PDMA_WIDTH_32 |
                        PDMA_SAR_FIX |    // Source Address Increment
                        PDMA_DAR_INC |    // Destination Address fixed
                        PDMA_REQ_SINGLE | // Transfer Type = single
                        PDMA_OP_SCATTER;  // Basic mode
    DMA_RXDESC[0].endsrc = (uint32_t)&I2S_PORT->RXFIFO;
    DMA_RXDESC[0].enddest = (uint32_t)&g_au32I2SRxPingPongBuff[0];
    DMA_RXDESC[0].offset = ((uint32_t)&DMA_RXDESC[1]);

    DMA_RXDESC[1].ctl = (((g_u16UAC_I2S_BUFF_LEN) - 1) << PDMA_DSCT_CTL_TXCNT_Pos) | // transfer byte count
                        PDMA_WIDTH_32 |
                        PDMA_SAR_FIX |    // Source Address Increment
                        PDMA_DAR_INC |    // Destination Address fixed
                        PDMA_REQ_SINGLE | // Transfer Type = single
                        PDMA_OP_SCATTER;  // Basic mode
    DMA_RXDESC[1].endsrc = (uint32_t)&I2S_PORT->RXFIFO;
    DMA_RXDESC[1].enddest = (uint32_t)&g_au32I2SRxPingPongBuff[g_u16UAC_I2S_BUFF_LEN];
    DMA_RXDESC[1].offset = ((uint32_t)&DMA_RXDESC[0]);

    // Open PDMA channel
    PDMA_Open(PDMA_PORT, PDMA_CH2_MASK);
    // Request source is memory to memory
    PDMA_SetTransferMode(PDMA_PORT, 2, PDMA_I2S0_RX, TRUE, DMA_RXDESC[1].offset);
    // Enable PDMA channel 1 interrupt
    PDMA_EnableInt(PDMA_PORT, 2, PDMA_INT_TRANS_DONE);
}

/**
 * @brief       PDMA_I2S_Tx_Init
 *
 * @param[in]   None
 *
 * @return      None
 *
 * @details     Initialize the PDMA channel for I2S0 TX request.
 */
void PDMA_I2S_Tx_Init(void)
{
    DMA_TXDESC[0].ctl = (((g_u16PlayBack_I2S_BUFF_LEN) - 1) << PDMA_DSCT_CTL_TXCNT_Pos) | // transfer byte count
                        PDMA_WIDTH_32 |
                        PDMA_SAR_INC |    // Source Address Increment
                        PDMA_DAR_FIX |    // Destination Address fixed
                        PDMA_REQ_SINGLE | // Transfer Type = single
                        PDMA_OP_SCATTER;  // Basic mode
    DMA_TXDESC[0].endsrc = (uint32_t)&g_au32I2STxPingPongBuff[0];
    DMA_TXDESC[0].enddest = (uint32_t)&I2S_PORT->TXFIFO;
    DMA_TXDESC[0].offset = ((uint32_t)&DMA_TXDESC[1]);

    DMA_TXDESC[1].ctl = (((g_u16PlayBack_I2S_BUFF_LEN) - 1) << PDMA_DSCT_CTL_TXCNT_Pos) | // transfer byte count
                        PDMA_WIDTH_32 |
                        PDMA_SAR_INC |    // Source Address Increment
                        PDMA_DAR_FIX |    // Destination Address fixed
                        PDMA_REQ_SINGLE | // Transfer Type = single
                        PDMA_OP_SCATTER;  // Basic mode
    DMA_TXDESC[1].endsrc = (uint32_t)&g_au32I2STxPingPongBuff[g_u16PlayBack_I2S_BUFF_LEN];
    DMA_TXDESC[1].enddest = (uint32_t)&I2S_PORT->TXFIFO;
    DMA_TXDESC[1].offset = ((uint32_t)&DMA_TXDESC[0]);

    // Open PDMA channel
    PDMA_Open(PDMA_PORT, PDMA_CH1_MASK);
    // Request source is memory to memory
    PDMA_SetTransferMode(PDMA_PORT, 1, PDMA_I2S0_TX, TRUE, DMA_TXDESC[1].offset);
    // Enable PDMA channel 1 interrupt
    PDMA_EnableInt(PDMA_PORT, 1, PDMA_INT_TRANS_DONE);

    NVIC_EnableIRQ(PDMA_IRQn);
}

/**
 * @brief       I2S_TX_Start
 *
 * @param[in]   None
 *
 * @return      None
 *
 * @details     Start I2S TX function and enable TX DMA function.
 */
void I2S_TX_Start(void)
{
    PDMA_I2S_Tx_Init();

    I2S_CLR_TX_FIFO(I2S_PORT);
    I2S_ENABLE_TXDMA(I2S_PORT);

    I2S_PORT->CTL0 |= I2S_CTL0_I2SEN_Msk;
}

/**
 * @brief       I2S_TX_Stop
 *
 * @param[in]   None
 *
 * @return      None
 *
 * @details     Stop I2S TX function and disable TX DMA function.
 */
void I2S_TX_Stop(void)
{
    PDMA_PORT->CHCTL &= ~(1ul << 1);
    PDMA_PORT->CHRST |= (1ul << 1);

    PDMA_CLR_TD_FLAG(PDMA_PORT, (1 << 1));
    I2S_DISABLE_TXDMA(I2S_PORT);
    I2S_DISABLE_TX(I2S_PORT);
    I2S_CLR_TX_FIFO(I2S_PORT);

    g_u8I2STxBuffIndex = 0;
    g_u16PlayBack_Read_Ptr = 0;
    g_u16PlayBack_Write_Ptr = 0;

