OpenNuvoton/M55M1BSP/SampleCode/NuMaker-M55M1/NuvotonAudioGUI_Firmware/main.c
    PlaybackPingpongBuffClear();
}

/**
 * @brief       I2S_RX_Start
 *
 * @param[in]   None
 *
 * @return      None
 *
 * @details     Start I2S RX function and enable RX DMA function.
 */
void I2S_RX_Start(void)
{
    PDMA_I2S_RX_Init();

    I2S_CLR_RX_FIFO(I2S_PORT);
    I2S_PORT->CTL0 |= I2S_CTL0_I2SEN_Msk;

    I2S_ENABLE_RX(I2S_PORT);
    I2S_ENABLE_RXDMA(I2S_PORT);
}

/**
 * @brief       I2S_RX_Stop
 *
 * @param[in]   None
 *
 * @return      None
 *
 * @details     Stop I2S RX function and disable RX DMA function.
 */
void I2S_RX_Stop(void)
{
    PDMA_PORT->CHCTL &= ~(1ul << 2);
    PDMA_PORT->CHRST |= (1ul << 2);
    PDMA_CLR_TD_FLAG(PDMA_PORT, (1 << 2));

    I2S_DISABLE_RXDMA(I2S_PORT);
    I2S_DISABLE_RX(I2S_PORT);
    I2S_CLR_RX_FIFO(I2S_PORT);

    g_u8I2SRxBuffIndex = 0;
    g_u16Record_Read_Ptr = 0;
    g_u16Record_Write_Ptr = 0;

    RecordPingpongBuffClear();
}

/**
 * @brief       Switch_I2S_Sample_Rate
 *
 * @param[in]   None
 *
 * @return      None
 *
 * @details     Switch I2S sample rate and re-configure the I2S0 related parameters.
 */
void Switch_I2S_Sample_Rate(void)
{
    // stop I2S TX/RX fuction
    I2S_TX_Stop();
    I2S_RX_Stop();

    CLK_SetModuleClock(I2S_MODULE, I2S_CLKSRC, 0);

    I2S_open(I2S_PORT, g_u32I2S0SerialMode, g_u32I2S0SampleRate, g_u32I2S0WordSize, g_u32I2S0Channel, g_u32I2S0Mono, g_u32I2S0Format, g_u32I2S0FrameSize);

    SYS_ResetModule(I2S_RST);

    // Set PDMA bus width
    if (g_u32I2S0WordSize == I2S_DATABIT_16)
    {
        I2S_SET_PBWIDTH(I2S_PORT, I2S_PBWIDTH_16);
        I2S_SET_PB16ORD(I2S_PORT, I2S_PB16ORD_LOW);
        I2S_SET_STEREOORDER(I2S_PORT, I2S_ORDER_EVENLOW);
    }
    else
    {
        I2S_SET_PBWIDTH(I2S_PORT, I2S_PBWIDTH_32);
#if (I2S_FIFO_24BIT_LSB)
        // LSB of 24-bit audio data in each channel is aligned to right side in 32-bit FIFO entries.
        I2S_SET_STEREOORDER(I2S_PORT, I2S_ORDER_EVENHIGH);
#elif (I2S_FIFO_24BIT_MSB)
        // MSB of 24-bit audio data in each channel is aligned to left side in 32-bit FIFO entries.
        I2S_SET_STEREOORDER(I2S_PORT, I2S_ORDER_EVENLOW);
#endif
    }

    // Set channel width.
    I2S_SET_CHWIDTH(I2S_PORT, g_u32I2S0FrameSize);

    if (g_u32I2S0SerialMode == I2S_MODE_MASTER)
    {
        I2S_EnableMCLK(I2S_PORT, g_u32I2S0SampleRate * 500);        //MCLK = 24M, with CLK_CLKSEL3_I2S0SEL_HIRC
    }
    else
    {
        I2S_EnableMCLK(I2S_PORT, 12000000); // MCLK = 12M, slave mode
    }
}

/**
 * @brief       Enable EP IN transfer
 *
 * @param[in]   epnum   Endpoint number
 *
 * @param[in]   *buf    The pointer of data buffer
 *
 * @param[in]   len     The length of data
 *
 * @return      None
 *
 * @details     Enable EP IN transfer function and start USB IN transfer.
 */
void HSUSBD_EnableEPTrans(uint32_t epnum, uint8_t *buf, uint32_t len)
{
    for (uint32_t i = 0; i < len; i++)
    {
        HSUSBD->EP[epnum].EPDAT_BYTE = buf[i];
    }

    HSUSBD->EP[epnum].EPTXCNT = len;

    HSUSBD_ENABLE_EP_INT(epnum, HSUSBD_EPINTEN_INTKIEN_Msk);
}

/**
 * @brief       I2S_open
 *
 * @param[in]   *i2s            The pointer of I2S module
 * @param[in]   u32MasterSlave  The operation mode of I2S module
 * @param[in]   u32SampleRate   The sample rate of I2S module
 * @param[in]   u32WordWidth    The word width of I2S module
 * @param[in]   u32Channels     The channel number of I2S module
 * @param[in]   u32Mono         The mono or stereo mode of I2S module
 * @param[in]   u32DataFormat   The data format of I2S module
 * @param[in]   u32I2S0FrameSize The frame size of I2S module
 *
 * @return      The real sample rate of I2S module
 *
 * @details     This function is used to configure the I2S controller and calculate the divider.
 */
static uint32_t I2S_open(I2S_T *i2s,
                         uint32_t u32MasterSlave,
                         uint32_t u32SampleRate,
                         uint32_t u32WordWidth,
                         uint32_t u32Channels,
                         uint32_t u32Mono,
                         uint32_t u32DataFormat,
                         uint32_t u32I2S0FrameSize)
{
    uint32_t u32Divider;
    uint32_t u32BitRate, u32SrcClk;

    /* Reset SPI/I2S */
    if (i2s == I2S0)
        SYS_ResetModule(SYS_I2S0RST);
    else
        SYS_ResetModule(SYS_I2S1RST);

    /* Configure I2S controller */
    i2s->CTL0 = u32MasterSlave | u32WordWidth | u32Mono | u32DataFormat;
    /* Set TDM channel number */
    I2S_SET_TDMCHNUM(i2s, u32Channels);

    /* Check Mono, Format, Channel, Datawidth setting*/
    if (u32Mono == I2S_MONO)
        u32Channels = 2;
    else
    {
        if (u32DataFormat == I2S_FORMAT_PCM || u32DataFormat == I2S_FORMAT_PCM_MSB || u32DataFormat == I2S_FORMAT_PCM_LSB)
            u32Channels = ((u32Channels >> I2S_CTL0_TDMCHNUM_Pos) + 1) * 2;
        else
            u32Channels = 2;
    }

    u32WordWidth = (u32WordWidth >> I2S_CTL0_DATWIDTH_Pos) + 1;
    u32I2S0FrameSize = (u32I2S0FrameSize >> I2S_CTL0_CHWIDTH_Pos) + 1;

    if (u32WordWidth == 1 && u32Channels > 2)
        u32WordWidth = 2;

    if (u32MasterSlave == I2S_MODE_MASTER)
    {
        uint32_t u32Error, u32Error2;

        /* Get the source clock rate */
        u32SrcClk = I2S_GetSourceClockFreq(i2s);

        u32BitRate = u32SampleRate * u32I2S0FrameSize * 8 * u32Channels;
        u32Divider = ((u32SrcClk / u32BitRate) >> 1) - 1;
        /* Adjust Error */
        u32Error = (u32SrcClk / (2 * (u32Divider + 1)) - u32BitRate);
        u32Error2 = (u32BitRate - u32SrcClk / (2 * (u32Divider + 2)));
        u32Divider = (u32Error < u32Error2) ? u32Divider : (u32Divider + 1);

        /* Set BCLKDIV setting */
        i2s->CLKDIV = (i2s->CLKDIV & ~I2S_CLKDIV_BCLKDIV_Msk) | (u32Divider << I2S_CLKDIV_BCLKDIV_Pos);

        /* Calculate bit clock rate */
        u32BitRate = u32SrcClk / ((u32Divider + 1) * 2);
        /* Calculate real sample rate */
        u32SampleRate = u32BitRate / (u32I2S0FrameSize * 8 * u32Channels);
    }
    else
    {
        /* Set BCLKDIV = 0 */
        i2s->CLKDIV &= ~I2S_CLKDIV_BCLKDIV_Msk;
        /* Get the source clock rate */
        u32SampleRate = I2S_GetSourceClockFreq(i2s);
    }

    /* Return the real sample rate */
    return u32SampleRate;
}

/*** (C) COPYRIGHT 2025 Nuvoton Technology Corp. ***/
